# InitialLuminousIntensity Constructor (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
InitialLuminousIntensity Constructor
InitialLuminousIntensity Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| InitialLuminousIntensity(Double) | Creates an initial luminous intensity object with the given document and luminosity values. |
| InitialLuminousIntensity(InitialLuminousIntensity) | Creates a copy of the given initial luminous intensity object |

# See Also
InitialLuminousIntensity Class
InitialLuminousIntensity Members
Autodesk.Revit.DB.Lighting Namespace